Autodesk.Revit.DB.Structure.RebarBarType.SetBarTypeDiameters(Autodesk.Revit.DB.BarTypeDiameterOptions)
Sets all input diameters from diametersOpt in current RebarBarType.
diametersOpt:
The input diameters are validated as follows :
barDiameter is both positive and no more than the smallest value of 1.0 and the input bend diameters.
Each bend diameter is smaller than 99.0 and bigger than barDiameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the diameters ranges in diametersOpt  are not acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018.1